{
  "main": {
    "name": "Vijay Godhasara",
    "occupation": "Senior Software Engineer @Zextras Group",
    "image": "vijay_godhasara.jpeg",
    "bio": "My name is Vijay Godhasara, and I'm a Senior Software Engineer currently working at Zextras Group. With over 13 years of experience in full-stack development, I have successfully delivered projects involving distributed systems. I excel in leadership, team management, adaptability, and problem-solving. My expertise lies in providing high-quality, robust solutions that consistently meet and exceed client expectations",
    "email": "vijaygodhasara@gmail.com",
    "phone": "+91 9978186691",
    "address": {
      "village": "Gota",
      "city": "Ahmedabad",
      "state": "Gujarat",
      "zip": "382481"
    },
    "resumedownload": "https://drive.google.com/file/d/1-MD_K6YV4-HBX301nswN42FwS9zEGZCN/view?usp=sharing",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/vijaygodhasara",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/vijaygodhasara",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/vijaygodhasara",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "",
    "education": [
      {
        "school": "LDRP Institute of Technology and Research",
        "degree": "Master of computer application",
        "graduated": "June 2010",
        "description": "Graduated with Distinction"
      }
    ],
    "work": [
      {
        "company": "ZEXTRAS GROUPS",
        "title": "Senior Software Engineer",
        "years": "March 2022 - Present",
        "description": "At Zextras Group, a technology company specializing in communication and collaboration solutions, I oversee development leadership, code review, integration, and QA builds. I facilitate daily scrum meetings and sprint activities, mentor team members, resolve dependencies, develop Admin Panel and Login UI components, define project structures, integrate modules, automate builds, implement TDD practices, deploy SonarQube for code quality, collaborate with the admin team on server setup and deployment, engage with project owners and stakeholders, optimize system performance and tracking, and prepare developer documentation. My efforts are dedicated to enhancing quality, productivity, and efficiency while ensuring clear requirements and stakeholder satisfaction."
      },
      {
        "company": "VNC India Pvt tld",
        "title": "Senior Software Engineer",
        "years": "July 2015 - March 2022",
        "description": "VNC India Pvt Ltd, a product-based company, entrusted me with conducting requirement analysis, designing and architecting products across web, desktop, and mobile platforms. I developed comprehensive test cases for quality assurance, led team management and development processes, conducted rigorous code reviews, orchestrated seamless integrations, and spearheaded project management using Redmine. I facilitated daily scrum meetings, actively participated in sprint activities, and implemented robust Single Sign-On solutions utilizing OpenAM, OpenDJ, and IDP-based Federation Services. Additionally, I innovated by designing and deploying a SAML plugin and connector in OpenIDM to streamline user provisioning. Furthermore, I contributed to enhancing workflow efficiency, bolstering security measures, optimizing user management processes, and ensuring punctual project deliveries through CI/CD pipeline implementations and release activities."
      },
      {
        "company": "Einfochips",
        "title": "Software Engineer",
        "years": "July 2010 - July 2015",
        "description": "At eInfochips, a service-based company, I contributed to multiple projects by conducting requirement analysis, designing and architecting solutions, collaborating with Cisco's technical team, implementing UI and business layers using various tools, working on distributed systems used by over 6000 customers, automating build and patch version processes, mentoring junior developers to ensure high-quality project delivery, and providing product support and maintenance."
      }
    ],
    "skills": [
    {
      "category": "Frontend Development",
      "items": [
        "React.js",
        "TypeScript",
        "Angular",
        "Bootstrap",
        "Redux",
        "RxJS",
        "Cordova",
        "JavaScript",
        "HTML",
        "CSS/SCSS",
        "Redux",
        "Zustand",
        "Jest",
        "Jasmine",
        "NightwatchJS",
        "Selenium",
        "Babel",
        "Webpack",
        "BrowserStack"
      ]
    },
    {
      "category": "Backend Development",
      "items": [
        "Java", 
        "J2EE", 
        "Spring",
        "Node.js", 
        "Express.js",
        "Shell scripting", 
        "Groovy",
        "SOAP API",
        "REST API",
        "Postman",
        "Hibernate",
        "MySQL", 
        "PostgreSQL", 
        "SQLite", 
        "Oracle"
      ]
    },
    {
      "category": "Middleware and Identity Management",
      "items": [
        "ForgeRock OpenAM", 
        "OpenDJ",
        "OpenIDM",
        "Zimbra mail server",
        "Zimbra plugin development"
      ]
    },
    {
      "category": "Development Methodologies/Tools",
      "items": [
        "Agile (Scrum, Kanban)",
        "Jira", 
        "Redmine",
        "npm", 
        "Maven",
        "Git (GitHub, GitLab, Bitbucket)",
        "SonarQube",
        "Posthog",
        "Sentry",
        "JFrog Artifactory"
      ]
    },
    {
      "category": "Additional Skills",
      "items": [
        "Debugging",
        "Profiling",
        "Leadership",
        "Mentoring",
        "Problem-solving",
        "Adpatibility",
        "Collaboration",
        "AWS (Amazon Web Services)",
        "Docker", 
        "Microservices architecture"
      ]
    }
  ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Carbonio",
        "category": "Carbonio is the open source e-mail and collaboration platform designed for big infrastructures. Advanced features for end-users and sys-admins.",
        "image": "carbonio.png",
        "url": "https://zextras.com/carbonio"
      },
      {
        "title": "VNCtalk",
        "category": "VNCtalk is an unique enterprise real time communication solution including chat, video and audio conferencing, screen sharing, voice messaging, file sharing, broadcasts, document collaboration and much more.",
        "image": "vnctalk.png",
        "url": "https://vnclagoon.com/products/vnctalk/"
      },
      {
        "title": "VNCchannels",
        "category": "VNCchannels is your place to store data, to search and retrieve information and to generate knowledge – collaboratively!",
        "image": "vncchannels.png",
        "url": "https://vnclagoon.com/products/vncchannels/"
      },
      {
        "title": "VNCmail",
        "category": "VNCmail offers all relevant mail features such as inbox, folders, filters, signatures, spam filters – in short, everything you are already familiar with from your everyday communication. And the clean VNCmail design makes communication fast and efficient",
        "image": "vncmail.png",
        "url": "https://vnclagoon.com/products/vncmail/"
      },
      {
        "title": "VNCtask",
        "category": "VNCtask offers Create tasks, manage them, get organized – all in one tool",
        "image": "vnctask.png",
        "url": "https://vnclagoon.com/products/vnctask/"
      },
      {
        "title": "VNCdirectory",
        "category": "VNCdirectory Full-blown directory tools for all VNClagoon applications. Integration with third party directory services.",
        "image": "vncdirectory.png",
        "url": "https://vnclagoon.com/products/vncdirectory/"
      },
      {
        "title": "Cisco Digital Media Manager",
        "category": "Manage, schedule, and publish compelling digital media with Cisco Digital Media Manager",
        "image": "dmm.avif",
        "url": "https://www.cisco.com/c/en/us/products/video/digital-media-manager/index.html"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "You cannot change your future, but you can change your habits, and surely your habits will change your future.",
        "user": "APJ Abdul Kalam"
      }
    ]
  }
}